HELYXcore-4.4.0/examples/legacy/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/coalCloud1Positions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      coalCloudPositions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.005 0.5 0.05)
(0.010 0.5 0.05)
(0.015 0.5 0.05)
(0.020 0.5 0.05)
(0.025 0.5 0.05)
(0.030 0.5 0.05)
(0.035 0.5 0.05)
(0.040 0.5 0.05)
(0.045 0.5 0.05)
(0.005 0.6 0.05)
(0.010 0.6 0.05)
(0.015 0.6 0.05)
(0.020 0.6 0.05)
(0.025 0.6 0.05)
(0.030 0.6 0.05)
(0.035 0.6 0.05)
(0.040 0.6 0.05)
(0.045 0.6 0.05)
(0.005 0.7 0.05)
(0.010 0.7 0.05)
(0.015 0.7 0.05)
(0.020 0.7 0.05)
(0.025 0.7 0.05)
(0.030 0.7 0.05)
(0.035 0.7 0.05)
(0.040 0.7 0.05)
(0.045 0.7 0.05)
)
// ************************************************************************* //
