HELYXcore-4.4.0/examples/legacy/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/coalCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coalCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    transient       yes;
    coupled         true;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             semiImplicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
            radiation       semiImplicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu       cell;
        T               cell;
        thermo-Cp       cell;
        kappa           cell;
        p               cell;
        G               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              300;
    Cp0             4187;
    epsilon0        1;
    f0              0.5;

    TDevol          400;
    LDevol          0;
    hRetentionCoeff 1;

    constantVolume  true;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            manualInjection;
            massTotal       0.0001;
            parcelBasisType mass;
            SOI             0;
            positionsFile   "coalCloud1Positions";
            U0              (0 -10 0);
            sizeDistribution
            {
                type        RosinRammler;
                RosinRammlerDistribution
                {
                    minValue        5e-06;
                    maxValue        0.0005;
                    d               5e-05;
                    n               0.5;
                }
            }
        }
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singleMixtureFraction;

    phaseChangeModel liquidEvaporation;

    devolatilisationModel constantRateDevolatilisation;

    stochasticCollisionModel none;

    surfaceReactionModel COxidationKineticDiffusionLimitedRate;

    surfaceFilmModel none;

    radiation       on;

    standardWallInteractionCoeffs
    {
        type            rebound;
        e               1;
        mu              0;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
                CH4             0.604;
                H2              0.099;
                CO2             0.297;
            }
            liquid
            {
                H2O             1;
            }
            solid
            {
                ash             0.136304;
                C               0.863696;
            }
        );
        YGasTot0        0.211;
        YLiquidTot0     0.026;
        YSolidTot0      0.763;
    }

    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids
        (
            H2O
        );
    }

    constantRateDevolatilisationCoeffs
    {
        volatileData
        (
            (CH4            12)
            (H2             12)
            (CO2            12)
        );
        residualCoeff   0.001;
    }

    COxidationKineticDiffusionLimitedRateCoeffs
    {
        Sb              1;
        C1              5.0E-12;
        C2              0.002;
        E               7.9E+07;
    }
}


cloudFunctions
{}


// ************************************************************************* //
