HELYXcore-4.4.0/examples/legacy/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/limestonePositions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      limestonePositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.0075 0.55 0.05)
(0.0125 0.55 0.05)
(0.0175 0.55 0.05)
(0.0225 0.55 0.05)
(0.0275 0.55 0.05)
(0.0325 0.55 0.05)
(0.0375 0.55 0.05)
(0.0425 0.55 0.05)
(0.0475 0.55 0.05)
(0.0075 0.45 0.05)
(0.0125 0.45 0.05)
(0.0175 0.45 0.05)
(0.0225 0.45 0.05)
(0.0275 0.45 0.05)
(0.0325 0.45 0.05)
(0.0375 0.45 0.05)
(0.0425 0.45 0.05)
(0.0475 0.45 0.05)
)
// ************************************************************************* //
