HELYXcore-4.4.0/examples/legacy/lagrangian/coalChemistryFoam/simplifiedSiwek/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            fixedTemperatureConstraint;

    timeStart       0.1;
    duration        0.4;
    selectionMode   cellSet;
    cellSet         ignitionCells;

    mode            uniform;
    temperature     2000;
}


// ************************************************************************* //
