HELYXcore-4.4.0/examples/legacy/lagrangian/coalChemistryFoam/simplifiedSiwek/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
mixture         standardMixture;
energy          sensibleEnthalpy;


defaultSpecie     N2;

liquids { H2O; }

solids
{
    C
    {
        rho             2010;
        Cp              710;
        kappa           0.04;
        Hf              0;
        emissivity      1.0;
    }

    ash;
}


species (N2 O2 CH4 H2 CO2 H2O);

CO2
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    equationOfState perfectGas;
    molWeight       44.01;
    thermodynamicsCoeffs
    {
        Tlow            0;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.85746 0.00441437 -2.21481e-06 5.2349e-10 -4.72084e-14 -48759.2 2.27164 );
        lowCpCoeffs     ( 2.35677 0.0089846 -7.12356e-06 2.45919e-09 -1.437e-13 -48372 9.90105 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.6;
    }
}

CH4
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    equationOfState perfectGas;
    molWeight       16.043;
    thermodynamicsCoeffs
    {
        Tlow            0;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 0.0748515 0.0133909 -5.73286e-06 1.22293e-09 -1.01815e-13 -9468.34 18.4373 );
        lowCpCoeffs     ( 5.14988 -0.013671 4.91801e-05 -4.84743e-08 1.66694e-11 -10246.6 -4.6413 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

H2
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    equationOfState perfectGas;
    molWeight       2.01594;
    thermodynamicsCoeffs
    {
        Tlow            0;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.33728 -4.94025e-05 4.99457e-07 -1.79566e-10 2.00255e-14 -950.159 -3.20502 );
        lowCpCoeffs     ( 2.34433 0.00798052 -1.94782e-05 2.01572e-08 -7.37612e-12 -917.935 0.68301 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

H2O
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    equationOfState perfectGas;
    molWeight       18.0153;
    thermodynamicsCoeffs
    {
        Tlow            0;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.03399 0.00217692 -1.64073e-07 -9.7042e-11 1.68201e-14 -30004.3 4.96677 );
        lowCpCoeffs     ( 4.19864 -0.00203643 6.5204e-06 -5.48797e-09 1.77198e-12 -30293.7 -0.849032 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

O2
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    equationOfState perfectGas;
    molWeight       31.9988;
    thermodynamicsCoeffs
    {
        Tlow            0;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.28254 0.00148309 -7.57967e-07 2.09471e-10 -2.16718e-14 -1088.46 5.45323 );
        lowCpCoeffs     ( 3.78246 -0.00299673 9.8473e-06 -9.6813e-09 3.24373e-12 -1063.94 3.65768 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

N2
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    equationOfState perfectGas;
    molWeight       28.0134;
    thermodynamicsCoeffs
    {
        Tlow            0;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44485e-12 -1020.9 3.95037 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

// ************************************************************************* //
