HELYXcore-4.4.0/examples/legacy/lagrangian/coalChemistryFoam/simplifiedSiwek/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

# create mesh
runApplication blockMesh

# create ignition cells cellSet
runApplication topoSet

runApplication $(getApplication)

#------------------------------------------------------------------------------
